MB3hel/Arduino-Core-MSP430/variants/MSP-EXP430G2ET2553LP/pins_arduino.h
const uintptr_t pin_dirreg[] = {
    0,                                                  // Placeholder. We count from 1 not 0.
    0,                                                  // VCC
    (const uintptr_t)(&P1DIR),                          // P1.0
    (const uintptr_t)(&P1DIR),                          // P1.1
    (const uintptr_t)(&P1DIR),                          // P1.2
    (const uintptr_t)(&P1DIR),                          // P1.3
    (const uintptr_t)(&P1DIR),                          // P1.4
    (const uintptr_t)(&P1DIR),                          // P1.5
    (const uintptr_t)(&P2DIR),                          // P2.0
    (const uintptr_t)(&P2DIR),                          // P2.1
    (const uintptr_t)(&P2DIR),                          // P2.2
    (const uintptr_t)(&P2DIR),                          // P2.3
    (const uintptr_t)(&P2DIR),                          // P2.4
    (const uintptr_t)(&P2DIR),                          // P2.5
    (const uintptr_t)(&P1DIR),                          // P1.6
    (const uintptr_t)(&P1DIR),                          // P1.7
    0,                                                  // RST
    0,                                                  // TEST
    (const uintptr_t)(&P2DIR),                          // P2.7
    (const uintptr_t)(&P2DIR),                          // P2.6
    0                                                   // GND
};

const uintptr_t pin_renreg[] = {
    0,                                                  // Placeholder. We count from 1 not 0.
    0,                                                  // VCC
    (const uintptr_t)(&P1REN),                          // P1.0
    (const uintptr_t)(&P1REN),                          // P1.1
    (const uintptr_t)(&P1REN),                          // P1.2
    (const uintptr_t)(&P1REN),                          // P1.3
    (const uintptr_t)(&P1REN),                          // P1.4
    (const uintptr_t)(&P1REN),                          // P1.5
    (const uintptr_t)(&P2REN),                          // P2.0
    (const uintptr_t)(&P2REN),                          // P2.1
    (const uintptr_t)(&P2REN),                          // P2.2
    (const uintptr_t)(&P2REN),                          // P2.3
    (const uintptr_t)(&P2REN),                          // P2.4
    (const uintptr_t)(&P2REN),                          // P2.5
    (const uintptr_t)(&P1REN),                          // P1.6
    (const uintptr_t)(&P1REN),                          // P1.7
    0,                                                  // RST
    0,                                                  // TEST
    (const uintptr_t)(&P2REN),                          // P2.7
    (const uintptr_t)(&P2REN),                          // P2.6
    0                                                   // GND
};

const uintptr_t pin_iesreg[] = {
    0,                                                  // Placeholder. We count from 1 not 0.
    0,                                                  // VCC
    (const uintptr_t)(&P1IES),                          // P1.0
    (const uintptr_t)(&P1IES),                          // P1.1
    (const uintptr_t)(&P1IES),                          // P1.2
    (const uintptr_t)(&P1IES),                          // P1.3
    (const uintptr_t)(&P1IES),                          // P1.4
    (const uintptr_t)(&P1IES),                          // P1.5
    (const uintptr_t)(&P2IES),                          // P2.0
    (const uintptr_t)(&P2IES),                          // P2.1
    (const uintptr_t)(&P2IES),                          // P2.2
    (const uintptr_t)(&P2IES),                          // P2.3
    (const uintptr_t)(&P2IES),                          // P2.4
    (const uintptr_t)(&P2IES),                          // P2.5
    (const uintptr_t)(&P1IES),                          // P1.6
    (const uintptr_t)(&P1IES),                          // P1.7
    0,                                                  // RST
    0,                                                  // TEST
    (const uintptr_t)(&P2IES),                          // P2.7
    (const uintptr_t)(&P2IES),                          // P2.6
    0                                                   // GND
};

const uintptr_t pin_iereg[] = {
    0,                                                  // Placeholder. We count from 1 not 0.
    0,                                                  // VCC
    (const uintptr_t)(&P1IE),                           // P1.0
    (const uintptr_t)(&P1IE),                           // P1.1
    (const uintptr_t)(&P1IE),                           // P1.2
    (const uintptr_t)(&P1IE),                           // P1.3
    (const uintptr_t)(&P1IE),                           // P1.4
    (const uintptr_t)(&P1IE),                           // P1.5
    (const uintptr_t)(&P2IE),                           // P2.0
    (const uintptr_t)(&P2IE),                           // P2.1
    (const uintptr_t)(&P2IE),                           // P2.2
    (const uintptr_t)(&P2IE),                           // P2.3
    (const uintptr_t)(&P2IE),                           // P2.4
    (const uintptr_t)(&P2IE),                           // P2.5
    (const uintptr_t)(&P1IE),                           // P1.6
    (const uintptr_t)(&P1IE),                           // P1.7
    0,                                                  // RST
    0,                                                  // TEST
    (const uintptr_t)(&P2IE),                           // P2.7
    (const uintptr_t)(&P2IE),                           // P2.6
    0                                                   // GND
};

const uintptr_t pin_ifgreg[] = {
    0,                                                  // Placeholder. We count from 1 not 0.
    0,                                                  // VCC
    (const uintptr_t)(&P1IFG),                          // P1.0
    (const uintptr_t)(&P1IFG),                          // P1.1
    (const uintptr_t)(&P1IFG),                          // P1.2
    (const uintptr_t)(&P1IFG),                          // P1.3
    (const uintptr_t)(&P1IFG),                          // P1.4
    (const uintptr_t)(&P1IFG),                          // P1.5
    (const uintptr_t)(&P2IFG),                          // P2.0
    (const uintptr_t)(&P2IFG),                          // P2.1
    (const uintptr_t)(&P2IFG),                          // P2.2
    (const uintptr_t)(&P2IFG),                          // P2.3
    (const uintptr_t)(&P2IFG),                          // P2.4
    (const uintptr_t)(&P2IFG),                          // P2.5
    (const uintptr_t)(&P1IFG),                          // P1.6
    (const uintptr_t)(&P1IFG),                          // P1.7
    0,                                                  // RST
    0,                                                  // TEST
    (const uintptr_t)(&P2IFG),                          // P2.7
    (const uintptr_t)(&P2IFG),                          // P2.6
    0                                                   // GND
};

const uint8_t pin_bitmask[] = {
    0,                                                  // Placeholder. We count from 1 not 0.
    0,                                                  // VCC
    BIT0,                                               // P1.0
    BIT1,                                               // P1.1
    BIT2,                                               // P1.2
    BIT3,                                               // P1.3
    BIT4,                                               // P1.4
    BIT5,                                               // P1.5
    BIT0,                                               // P2.0
    BIT1,                                               // P2.1
    BIT2,                                               // P2.2
    BIT3,                                               // P2.3
    BIT4,                                               // P2.4
    BIT5,                                               // P2.5
    BIT6,                                               // P1.6
    BIT7,                                               // P1.7
    0,                                                  // RST
    0,                                                  // TEST
    BIT7,                                               // P2.7
    BIT6,                                               // P2.6
    0                                                   // GND
};

