MB3hel/Arduino-Core-MSP430/variants/MSP-EXP430G2ET2553LP/pins_arduino.h
const uint8_t pin_adcch[] = {
    255,                                                // Placeholder. We count from 1 not 0.
    255,                                                // VCC
    0,                                                  // P1.0
    1,                                                  // P1.1
    2,                                                  // P1.2
    3,                                                  // P1.3
    4,                                                  // P1.4
    5,                                                  // P1.5
    255,                                                // P2.0
    255,                                                // P2.1
    255,                                                // P2.2
    255,                                                // P2.3
    255,                                                // P2.4
    255,                                                // P2.5
    6,                                                  // P1.6
    7,                                                  // P1.7
    255,                                                // RST
    255,                                                // TEST
    255,                                                // P2.7
    255,                                                // P2.6
    255                                                 // GND
};

#endif // ARDUINO_MAIN


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial
